In [41]:
import numpy as np
import pandas as pd

#The Machine learning alogorithm
from sklearn.ensemble import RandomForestClassifier

# Test train split
from sklearn.cross_validation import train_test_split


# Just to switch off pandas warning
pd.options.mode.chained_assignment = None


# Used to write our model to a file
from sklearn.externals import joblib

# read test data from csv file using panda library
data = pd.read_csv("titanic_train.csv")
data.head()

,Unnamed: 0,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,998,999,3rd,1,"McCarthy, Miss Katie",NaN,NaN,NaN,NaN,NaN,NaN,female
1,179,180,1st,0,"Millet, Mr Francis Davis",65.0,Southampton,"East Bridgewater, MA",NaN,NaN,(249),male
2,556,557,2nd,0,"Sjostedt, Mr Ernst Adolf",59.0,Southampton,"Sault St Marie, ON",NaN,NaN,NaN,male
3,174,175,1st,0,"McCaffry, Mr Thomas Francis",46.0,Cherbourg,"Vancouver, BC",NaN,NaN,(292),male
4,1232,1233,3rd,0,"Strilic, Mr Ivan",NaN,NaN,NaN,NaN,NaN,NaN,male

In [42]:
data.columns

Index(['Unnamed: 0', 'row.names', 'pclass', 'survived', 'name', 'age',
       'embarked', 'home.dest', 'room', 'ticket', 'boat', 'sex'],
      dtype='object')

In [43]:
data['age'].head()

0     NaN
1    65.0
2    59.0
3    46.0
4     NaN
Name: age, dtype: float64

In [44]:
data['age'].median()

29.0

In [45]:
data['sex'].unique()

array(['female', 'male'], dtype=object)

In [46]:
median_age = data['age'].median()
print('median age is {}'.format(median_age))

median age is 29.0

In [47]:
data['age'].fillna(median_age, inplace = True)
data['age'].head()

0    29.0
1    65.0
2    59.0
3    46.0
4    29.0
Name: age, dtype: float64

In [48]:
data.columns

Index(['Unnamed: 0', 'row.names', 'pclass', 'survived', 'name', 'age',
       'embarked', 'home.dest', 'room', 'ticket', 'boat', 'sex'],
      dtype='object')

In [49]:
data_inputs = data[['pclass','age','sex']]
data_inputs.head()

  pclass   age     sex
0    3rd  29.0  female
1    1st  65.0    male
2    2nd  59.0    male
3    1st  46.0    male
4    3rd  29.0    male

In [50]:
expected_output = data[['survived']]
expected_output.head()

   survived
0         1
1         0
2         0
3         0
4         0

In [51]:
data_inputs['pclass'].replace("3rd", 3, inplace = True)
data_inputs.head()

  pclass   age     sex
0      3  29.0  female
1    1st  65.0    male
2    2nd  59.0    male
3    1st  46.0    male
4      3  29.0    male

In [52]:
data_inputs['pclass'].replace("2nd", 2, inplace = True)
data_inputs.head()

  pclass   age     sex
0      3  29.0  female
1    1st  65.0    male
2      2  59.0    male
3    1st  46.0    male
4      3  29.0    male

In [53]:
data_inputs['pclass'].replace("1st", 1, inplace = True)
data_inputs.head()

   pclass   age     sex
0       3  29.0  female
1       1  65.0    male
2       2  59.0    male
3       1  46.0    male
4       3  29.0    male

In [54]:
data_inputs['sex'].replace("female",0,inplace = True)
data_inputs.head()

   pclass   age   sex
0       3  29.0     0
1       1  65.0  male
2       2  59.0  male
3       1  46.0  male
4       3  29.0  male

In [55]:
data_inputs['sex'].replace("male",1,inplace = True)
data_inputs.head()

   pclass   age  sex
0       3  29.0    0
1       1  65.0    1
2       2  59.0    1
3       1  46.0    1
4       3  29.0    1

In [56]:
inputs_train, inputs_test, expected_output_train, expected_output_test   = 
train_test_split (data_inputs, expected_output, test_size = 0.33, random_state = 42)

SyntaxError: invalid syntax (<ipython-input-56-eab4676f1ba3>, line 1)

In [ ]:
inputs_trains.head()

In [ ]:
inputs_train, inputs_test, expected_output_train, expected_output_test   = 
train_test_split (data_inputs, expected_output, test_data = 0.33, random_state = 42)

In [ ]:
inputs_train, inputs_test, expected_output_train, expected_output_test   = 
train_test_split (data_inputs, expected_output, test_size = 0.33, random_state = 42)

In [ ]:
inputs_train, inputs_test, expected_output_train, expected_output_test = train_test_split (data_inputs, expected_output, test_size = 0.33, random_state = 42)

In [ ]:
inputs_train.head()

In [ ]:
inputs_test.head()

In [ ]:
rf = RandomForestClassifier (n_estimators=100)

In [ ]:
rf.fit(inputs_train, expected_output_train)

In [ ]:
accuracy = rf.score(inputs_test, expected_output_test)
print("Accuracy = {}%".format(accuracy * 100))

In [ ]:
accuracy = rf.score(inputs_test, expected_output_test)
print("Accuracy = {}%".format(accuracy * 100))